---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraintsManager.HasValidRebar
source: html/6744e58e-e5ae-78ae-4183-1558827782b4.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraintsManager.HasValidRebar Method

Checks whether the Manager's Rebar is still valid.

## Syntax (C#)
```csharp
public bool HasValidRebar()
```